Revit 2026 API

# PartUtilsGetSplittingCurves(Document, ElementId, Plane) Method

---

Identifies the curves that were used to create the part and the plane in which they reside.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<Curve> GetSplittingCurves(
	Document document,
	ElementId partId,
	out Plane sketchPlane
)
```
```vb
Public Shared Function GetSplittingCurves (
	document As Document,
	partId As ElementId,
	<OutAttribute> ByRef sketchPlane As Plane
) As IList(Of Curve)
```
```cpp
public:
static IList<Curve^>^ GetSplittingCurves(
	Document^ document,
	ElementId^ partId,
	[OutAttribute] Plane^% sketchPlane
)
```
```fsharp
static member GetSplittingCurves :
        document : Document *
        partId : ElementId *
        sketchPlane : Plane byref -> IList<Curve>
```

#### Parameters

document Document
     The source document of the part.
partId ElementId
     The part id.
sketchPlane Plane
     The plane in which the division curves were sketched.

#### Return Value

IListCurve The curves that created the part. Empty if partId is not a part or Part is not divided.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

GetSplittingCurves Overload

Autodesk.Revit.DB Namespace